Revit 2027 API
PipingSystemType.Create Method
 Creates a new instance of a piping system type and adds it to the document.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PipingSystemType Create(
	Document ADoc,
	MEPSystemClassification systemClassification,
	string name
)
Public Shared Function Create (
	ADoc As Document,
	systemClassification As MEPSystemClassification,
	name As String
) As PipingSystemType
public:
static PipingSystemType^ Create(
	Document^ ADoc,
	MEPSystemClassification systemClassification,
	String^ name
)
static member Create :
        ADoc : Document *
        systemClassification : MEPSystemClassification *
        name : string -> PipingSystemType
Parameters
ADoc Document
 The document where the element will be created and added.
systemClassification MEPSystemClassification
 The classification for the piping system type to be created
name String
 The name of the piping system type to be created.
Return Value
PipingSystemType
 The newly created piping system type element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
ArgumentsInconsistentException |  The system classification is not valid for the domain of this system type.
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace